---
layout: post
title: "第7章 型や型クラスを自分で作ろう 後編"
date: 2014-02-02 23:48
comments: false
categories: Haskell
---

# 前回やったこと

- データ型の定義
- データ型のエクスポート
- レコード構文
- 多相型と型引数
- インスタンスの自動導出

{% oembed https://twitter.com/knjname/status/427053066030833664 %}
{% oembed https://twitter.com/nobkz/status/428789457068646401 %}
{% oembed https://twitter.com/nida_001/status/428789602015387648 %}
{% oembed https://twitter.com/tail_y/status/428822946719604736 %}
{% oembed https://twitter.com/VoQn/status/429091683783806976 %}

# 今回やること

- 型シノニム
 - 型シノニムの多相化
- 再帰的なデータ構造
- 演算子の定義
- 型クラス
 - 型クラスの定義
 - 型クラスのサブクラス
 - 型クラス制約
 - 多相性
- Functor型クラス
- 型の種類

# 型と新しい型(type and newtype)

## type

何章か前に出てきましたが `[Char]` と `String` は同値で、交換可能です。
ghciで `:i String` としてみてください。

```haskell
> :i String
type String = [Char]    -- Defined in `GHC.Base'
```

```haskell
type 型構築子 型引数1 型引数2 ... = 元の型
```

> typeは型のシノニムが定義されているのであって、新しい型が作られている訳ではありません。

ちょっと復習ですが、名前、年齢、身長、体重、電話番号を持つUserを表すデータ型は、

```haskell
data User = User String Int Float Float String
    deriving (Show)

name :: User -> String
name (User name _ _ _ _ ) = name

age :: User -> Int
age (User _ age _ _ _) = age

height :: User -> Float
height (User _ _ height _ _) = height

weight :: User -> Float
weight (User _ _ _ weight _) = weight

phoneNumber :: User -> String
phoneNumber (User _ _ _ _ phoneNumber) = phoneNumber
```

このようになって、値構築子(値コンストラクタ)は関数なので `:type` で型シグネチャを見ることができます。

```haskell
> :t User
User :: String -> Int -> Float -> Float -> String -> User
```

型シグネチャだけ見ても何を渡せばいいのか分からないということで、レコード構文もやりました。

```haskell
data User = User { name :: String
                 , age :: Int
                 , height :: Float
                 , weight :: Float
                 , phoneNumber :: String } deriving (Show)
```

```haskell
> :t User
User :: String -> Int -> Float -> Float -> String -> User
```

typeを使うと下のように表すことができます。

```haskell
type Name = String
type Age = Int
type Height = Float
type Weight = Float
type PhoneNumber = String

data User = User Name Age Height Weight PhoneNumber
    deriving (Show)

name :: User -> Name
name (User name _ _ _ _ ) = name

age :: User -> Age
age (User _ age _ _ _) = age

height :: User -> Height
height (User _ _ height _ _) = height

weight :: User -> Weight
weight (User _ _ _ weight _) = weight

phoneNumber :: User -> PhoneNumber
phoneNumber (User _ _ _ _ phoneNumber) = phoneNumber
```

```haskell
> :t User
User :: Name -> Age -> Height -> Weight -> PhoneNumber -> User
```

Haskellにはtypeの他にnewtypeもある。

### newtype

```haskell
newtype 型構築子 型引数1 型引数2 ... = 値構築子 フィールド
```

次のプログラムは "0123" のような数字列を表す型DigitStringを定義したものです。
関数atoiは、数字列を整数に変換する関数です。
引数が数字列であるべきことを強調するために、String型ではなくDigitString型の値を引数に要求します。

```haskell
newtype DigitString = DigitString String

atoi :: DigitString -> Int
atoi (DigitString xs) = read xs
```

```haskell
> let n = DigitString "99"
> atoi n
99
```

typeは、既存の型に別名を付けるもので、newtypeは、値構築子数1、フィールド数1の型専用のdata宣言とでも言うべきもので、既存の型をラップした型を与えます。

## data and type and newtype

- [Haskellのdataとtypeとnewtypeの違い](http://hnakamur.blogspot.jp/2011/07/haskelldatatypenewtype.html)
- [Difference between `data` and `newtype` in Haskell](http://stackoverflow.com/questions/5889696/difference-between-data-and-newtype-in-haskell)
- [Haskell Type vs Data Constructor](http://stackoverflow.com/questions/18204308/haskell-type-vs-data-constructor)

# 型シノニムの多相化

前回のおさらい

> 型コンストラクタは型引数を取ることができます。

```haskell
> :i Maybe
data Maybe a = Nothing | Just a
```

> 値コンストラクタが引数を取って新しい値を生み出すものでしたが、同じように型コンストラクタは型引数を取って新しい型を作るものです。
> MaybeにIntを渡すとMaybe Int型が得られますし、MaybeにStringを渡せばMaybe String型が得られます。
> こうすることで、

```haskell
data IntMaybe = INothing | IJust Int
data StringMaybe = SNothing | SJust String
data ShapeMaybe = ShNothing | ShJust Shape
```

> のように、中身の型ごとに別々の型にする必要がなくなります。

という感じで、型シノニムも多相化することができます。

```haskell
type AssocList k v = [(k, v)]
```

こうすることで、連想リストからキーを検索してくれる関数の型を `(Eq k) => k -> AssocList k v -> Maybe v` と書けるようになります。

# haskell-jobqueue


{% oembed https://twitter.com/gree_tech/status/426666332973580288 %}

```
-- haskell-jobqueue/src/Network/JobQueue/Types.hs
data Next a = Next {
    nextJob :: (Maybe a)
  , nextForks :: [(a, Maybe UTCTime)]
  }

type JobResult a = Either Failure (Next a)

setNextJob :: (Unit a) => a -> (JobResult a) -> (JobResult a)
setNextJob x (Right next@(Next _ju _xs)) = Right next { nextJob = Just x }
setNextJob _ jr@(Left _) = jr
```

ジョブとJobResultを引数にして、JobResultのRightだったら次のジョブをセットしたJobResultを返して、LeftだったらそのままJobResultを返す。

```haskell
-- haskell-jobqueue/src/Network/JobQueue/JobQueue.hs
type FailureHandleFn a = Alert -> String -> String -> Maybe (Job a) -> IO (Maybe (Job a))
type AfterExecuteHandleFn a = Job a -> IO ()

data (Unit a) => Settings a = Settings {
    failureHandleFn :: FailureHandleFn a
  , afterExecuteFn :: AfterExecuteHandleFn a
  }
```

長い型をtypeで表したりとかもする。

# 再帰的なデータ構造

時間があったら。

# 演算子の定義

すごいH本138ページあたりの演算子を定義する話。

まず、演算子を定義する。

```haskell
infixr 5 :-:
data List a = Empty | a :-: (List a ) deriving (Show, Read, Eq, Ord)

infixr 5 ^++
(^++) :: List a -> List a -> List a
Empty ^++ ys ys
(x :-: xs) ^++ ys = x :-: (xs ^++ ys)
```

そして使う。

```haskell
> let a = 3 :-: 4 :-: 5 :-: Empty
> let b = 6 :-: 7 :-: Empty
> a ^++ b
3 :-: (4 :-: (5 :-: (6 :-: (7 :-: Empty))))
```

![](http://img.tiqav.com/8q.th.jpg)

これを見てもあまり嬉しいと感じられないと思うので、自分で便利そうな演算子を何か一個、作ってみましょう。

### 例. 三項演算子っぽい何か

```haskell
> [x > 5 ? 1 : 2 | x <- [1..10]]
> [2,2,2,2,2,1,1,1,1,1]
```

(これは実現できないので、これっぽいなにかを)

[Haskellの演算子について纏めてみた](http://d.hatena.ne.jp/marony0607/20111205/1323103005)

# 型クラス

型クラスはインターフェイスのようなものです。型クラスは、特定の振る舞い(等値性判定だとか、順序の比較だとか、列挙だとか)を定義します。
定義されたとおりに振る舞うことができる型は、その型クラスのインスタンスである、といいます。

## 型クラスの定義

Eq型クラスを例に取りましょう。
Eqは等値性判定ができる(`==` や `/=`) という関数を定義している)値の型クラスです。
これは標準ライブラリにおけるEqの定義です。

```haskell
class Eq a where
  (==) :: a -> a -> Bool
  (/=) :: a -> a -> Bool
  x == y = not (x /= y)
  x /= y = not (x == y)
```

クラスには関数定義と、オプションでデフォルト実装を書くことができます。

## 型クラスのサブクラスの定義

別の型クラスのサブクラスである型クラスを作ることもできます。
たとえばNumの型クラス宣言の最初のところは以下のようになっています。

```haskell
class (Eq a) => Num a where
  ...
```

aはEqの振る舞いを実装している必要もある、というふうになります。

## 型クラス制約

リストの要素の和を求める関数sumの型がもし、

```haskell
sum :: [Int] -> Int
```

では具体的すぎます。かといって、

```haskell
sum :: [a] -> a
```

では広すぎです。そこで、次のような制約付きの宣言が使われます。

```haskell
sum :: Num a => [a] -> a
```

sumの型シグネチャ宣言におけるNum aは、型aがNumクラスのインスタンスでなければならないという制約を表します。
この制約は、型クラス制約、あるいは文脈(Context)と呼ばれます。

## インスタンス化

ここで先週作った曜日のデータ型をみてみましょう。

> 使える自動導出を全部使って、曜日のデータ型を作ってみましょう。

```haskell
data Day = Monday | Tuesday | Wednesday | Thursday | Friday | Saturday | Sunday deriving (Eq, Ord, Show, Read, Bounded, Enum)
```

Eq、Ord、Show、Read、Bounded、Enumを自動導出していましたが、いくつかを手動で導出してみましょう。

```haskell
data Day = Monday | Tuesday | Wednesday | Thursday | Friday | Saturday | Sunday

instance Eq Day where
  Monday == Monday = True
  Tuesday == Tuesday = True
  Wednesday == Wednesday = True
  Thursday == Thursday = True
  Friday == Friday = True
  Saturday == Saturday = True
  Sunday == Sunday = True
  _ == _ = False

instance Show Day where
  show Monday = "Monday"
  show Tuesday = "Tuesday"
  show Wednesday = "Wednesday"
  show Thursday = "Thursday"
  show Friday = "Friday"
  show Saturday = "Saturday"
  show Sunday = "Sunday"

instance Ord Day where
```

```haskell
> Monday == Sunday
False
> Monday /= Sunday
True
> Friday
Friday
> Monday < Tuesday
...
```

では、まず引数をStringにして返すputs関数を作って、

```haskell
puts :: (Show a) => a -> String
puts a = show a
```

```haskell
> puts 'a'
"'a'"
> puts 1
"1"
```

それから、IntかCharしか受け取れないように型クラス制約を付けてみましょう。


```haskell
> puts 'a'
"'a'"
> puts (1 :: Int)
"1"
> puts (1 :: Float)

<interactive>:14:1:
    No instance for (IntOrChar Float)
      arising from a use of `puts'
    Possible fix: add an instance declaration for (IntOrChar Float)
    In the expression: puts (1 :: Float)
    In an equation for `it': it = puts (1 :: Float)
```

## 多相性

- [Polymorphismまとめ](http://yingtai.hatenablog.com/entry/2012/08/17/215648)


### パラメータ多相(parametric)

Haskellのリストを例に取ると、

```haskell
length :: [a] -> Int
length [] = 0
length (x:xs) = 1 + length xs
```

```
> length [1,2,3]   -- [Int] -> Int
3
> length "foobar"  -- [Char] -> Int
6
```

この関数のアルゴリズムはリストの中身の型に依存しません。
言い換えれば、length関数は型に関わらず同じ操作をしています。
このようなタイプの多相をパラメータ多相と呼びます。

- C++のテンプレート
- Javaのジェネリクス

### アドホック多相(ad-hoc)

Haskellでは型クラスにもとづき、型によって振る舞いを変えることをアドホック多相といいます。

一般的にはアドホック多相にはオーバーロードと型キャストの二つがあります。

#### オーバーロード

Cを例に取ると、

```c
n = 1 + 3;        // 整数の加算
r = 1.5 + 2.5;    // 実数の加算
```

ここでの `+` 演算子の振る舞いは多相的ですが、実際の加算アルゴリズムは異なります。
この意味で、この2つの演算子が同じ `+` であることの必然性はあまりなく、便宜上そうなっているだけ(ad-hoc)にすぎません。

#### 型キャスト

```c
x = 1.5 + 10;
```

このとき `+` の左側は実数型、右側は整数型です。
このとき `+` 演算子は見かけの上でだけ多相的です。

- C++/Javaのメソッドのオーバーロード

### 部分型多相(inclusion, subtyping)

`Dog, Cat ∈ Animal` という型の関係があったとき、
Animal型のオブジェクトにsayメソッドが適用できるならば、
Dog型、Cat型のオブジェクトにもsayメソッドが適用できる、といった多相です。

オブジェクト指向で主に「多態」と呼ばれるタイプの多相。

### ピンと来ない？

アドホック多相は、関数を適用する型を制限するのに対して、パラメータ多相は、具体的な型について言及しないことにより、新しい型に対応できるようにするということらしいです。

- [Haskellでの多態 (多相)](http://www.nslabs.jp/haskell-poly.rhtml)
- [Scalaで型クラス入門](http://chopl.in/blog/2012/11/06/introduction-to-typeclass-with-scala.html)

# Functor型クラス

Functor(関手)は、全体を写せる（map over）ものの型クラスです。
map overと聞いて、リストのmapを思い出しませんか？
あれも何かを写す操作の典型例です。

Functor型クラスの実装を覗いてみましょう。

```haskell
class Functor f where
    fmap :: (a -> b) -> f a -> f b
```

見てのとおりFunctorは1つの関数 fmap を持っており、デフォルト実装は提供しておりません。
どうやらfmapは、「ある型aから別の型bへの関数」と、「ある型aに適用されたファンクター値」を取り、「別の型bの方に適用されたファンクター値」を返す関数のようです。

ところで、fmapの型宣言は何かに似ていると思いませんか？

```haskell
> :t fmap
fmap :: Functor f => (a -> b) -> f a -> f b
> :t map
map :: (a -> b) -> [a] -> [b]
```

mapは、「ある型から別の型への関数」と、「ある型のリスト」を取り、「別の型のリスト」を返す関数のようです。

実は、リストはFunctor型クラスのインスタンスで、mapというのはリスト限定で動作するfmapなのです。

```haskell
> :i []
data [] a = [] | a : [a]        -- Defined in `GHC.Types'
instance Functor [] -- Defined in `GHC.Base'
...

instance Functor [] where
    fmap = map
```

![](https://dl.dropboxusercontent.com/u/949822/qiita.com/131125-functors-applicative-and-monads-in-picture/fmap_list.png)

リストにとってのfmapはただのmapであるため、2つの関数をリストに使った結果は一致します。

```haskell
> fmap (*2) [1..3]
[2,4,6]
> map (*2) [1..3]
[2,4,6]
```

Functorになれるのは、箱のような働きをする型です。
リスト以外にも例えばMaybe aがFunctorです。
MaybeはこんなふうにFunctorになっています。

```haskell
> :i Maybe
data Maybe a = Nothing | Just a         -- Defined instance Functor Maybe -- Defined in `Data.Maybe'
...

instance Functor Maybe where
  fmap f (Just x) = Just (f x)
  fmap f Nothing = Nothing
```

fmapの実装はいたってシンプルです。
もし2つ目の引数が値の入ったJustだったら関数をJustの中身に適用して、Nothingだったら、Nothingを返します。

<img src="http://yogsototh.github.io/Category-Theory-Presentation/categories/img/mp/boxfunctor.png" width="400">

```haskell
> fmap (++ " HEY GUYS IM INSIDE THE JUST") (Just "Something serious.")
Just "Something serious. HEY GUYS IM INSIDE THE JUST"
> fmap (++ " HEY GUYS IM INSIDE THE JUST") Nothing
Nothing
> fmap (*2) (Just 200)
Just 400
> fmap (*2) Nothing
Nothing
```

- [箱で考えるFunctor、ApplicativeそしてMonad](http://qiita.com/suin/items/0255f0637921dcdfe83b)
- [Haskell/圏論](http://ja.wikibooks.org/wiki/Haskell/%E5%9C%8F%E8%AB%96)
- [Functorを例として、圏論とHaskellの関係を分かりやすく説明してみるテスト](http://d.hatena.ne.jp/enakai00/20130912/1378970253)

# 型の種類

`[a]` や `Maybe a` のような型コンストラクタは、他の型を引数に取って具体型になります。
この振る舞いは、関数が値を引数に取って値を生み出すのとよく似ています。
それに、関数と同じく型コンストラクタも部分適用できます。
ここでは、型が型コンストラクタに適用される様子を形式的に定義してみます。

3、"YEAH!"、takeWhileといった値（関数も受け取ったり渡したりできる値です）は、それぞれ固有の値を持っています。
型とは、値について何らかの推測をするための小さなラベルです。
そして型にも小さなラベルがついています。
その名は種類（kind）。種類は、「型の型」のようなものです。

ghciの `:kind` コマンドを使って、型の種類をみてみましょう。

```haskell
> :k Int
Int :: *
> :k []
[] :: * -> *
> :k Maybe
Maybe :: * -> *
```

`*` (スター)は、具体型を表す記号です。
`[]` や `Maybe` は1つの具体型(例えばInt)を取って具体型(例えばMaybe Int)を返す型コンストラクタであることが分かります。

型コンストラクタに型引数を与えて、どんな種類の型ができるか調べてみましょう。

```haskell
> :k [Char]
[Char] :: *
> :k Maybe Int
Maybe Int :: *
```

型引数を与えると、具体型になりました。
型は値のラベルであり、種類は型のラベルである、という対応関係があるわけです。

改めてFunctorの定義を見直すと、型変数fは1つの具体型を取って具体型を生み出す型として使われていることが見て取れます。

```haskell
class Functor f where
    fmap :: (a -> b) -> f a -> f b
```

関数の型宣言で値の型として使われていることから `f a` や `f b` は具体型でなければならないことが分かります。
Functorになるには `* -> *` という種類を持つ必要があるということが分かります。

# 今後のスケジュール

- [sugoihaskell.github.io](http://sugoihaskell.github.io/)
